In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data.csv')

In [3]:
df

     Name        Foo  Bar  Baz
0   Alice       12.0    9    3
1     Bob  2200000.0   12   13
2  Charli  2200000.0    7   11

In [4]:
df['Foo'] = df['Bar'] + df['Baz']

In [5]:
df

     Name  Foo  Bar  Baz
0   Alice   12    9    3
1     Bob   25   12   13
2  Charli   18    7   11